{
"name":"Mason's Art",
"desc":"Mason's art gallery",
"tags":true,
"time":10,
"images":[
{"name":"Traffic Cone", "desc":"An orange traffic cone. An exploration into the different colours that exist in a photo, and not just a couple of colours. I had to create a palette first (based on the colours in the photo), then I used the colours from my palette to paint my painting. <h2>Discussion Q&A</h2><b>1. Describe the medium or materials used in this piece of artwork.</b>\n<br />I used acrylic paint, which is a type of plastic-based paint. This paint can be applied generously to the canvas and mixed on the canvas. If you make any mistakes, it is easy to just paint over them. In my piece, acrylic paint helped me paint the blending colours of the grass and the sky. As well, I was able to layer paints to create more colour depth in the traffic cone itself.\n<br />\n<br /><b>7. What excited you about this project? Why?</b>\n<br />I was excited to paint something unorthodox like a traffic cone. The colours of it contrasted really well compared to the background, which made it stand out even more (which it should, given the fact that it's a traffic cone...)\n<br />\n<br /><b>12. What idea or message are you trying to get across?</b>\n<br />A lot of things can be considered art.\n<br />\n<br /><b>14. How would you summarize your art work?</b>\n<br />An orange traffic cone.\n<br />\n<br /><b>17. Were you happy with the final result? Why or why not?</b>\n<br />I am mostly happy with the final result, as I feel like I did pretty well on it. However, with my knowledge after doing this piece, I could do better if I redid it, but for what I did at the time, I am mostly proud of it.\n<br />\n<br /><b>18. Did you enjoy the project? Why or why not?</b>\n<br />I enjoyed this project, as I found it fun to play with a new medium compared to other projects.\n<br />\n<br /><b>20. Is there anything you could have done to improve any of your work? Explain.</b>\n<br />When drawing a basic grid to help determine where the cone would be, I did not erase the lines afterwards before painting over them. As a result, in some of the lighter areas of the cone, it is possible to see some of the line still. In the future, now that I know that pencil gets into a canvas, I would erase the lines first. As well, my cone looks a bit flat since the lines are so straight. While this might be caused by the fact that I painted the pixellated artwork (which had hard edges), when I made my own painting less pixellated, I kept the straight edges.", "thumb":"", "img":"http://i.imgur.com/OvP6Ivl.jpg", "tags":[]},
{"name":"Illumi-naught", "desc":"I arranged triangles into a traingle with an eye inside it, a common characteristic of the (very real) illuminati. I created multiple frames going from this ordered traingle to a bunch of randomly scattered triangles, starting from a single point (you can imagine what you want in terms of what this symbolizes). Afterwards, I took photos of the arrangements and used a GIF creator app to arrange them into a GIF.", "thumb":"", "img":"http://i.imgur.com/Uylz9zj.gif", "tags":[]},
{"name":"Mandala", "desc":"This is a mandala created using a combination of watercolour and technological editing.\n<br />\n<br />The base triangles were hand-drawn and filled in with watercolour. Afterwards, I scanned them, copied on a computer, and arranged them into a circle to form a digital mandala.\n<br />\n<br />This was a fun exploration of positive and negative space, and it also helped me improve my skills with watercolours a bit.", "thumb":"", "img":"http://i.imgur.com/cR9KiJC.jpg", "tags":[]},
{"name":"Colours", "desc":"This collage is meant to be an exploration of colour, and the many sources of colour.\n<br />\n<br />I went through a lot of images on the internet (primairly using Google's search by colour option) and picked some of my favourite ones and compiled them into the collage.", "thumb":"", "img":"http://i.imgur.com/PZSMbwp.jpg", "tags":[]},
{"name":"The Cat", "desc":"An animated short film about a missing pet, created using stop motion.\n<br />\n<br />Alex and I created clay figurines and then we took photos of them and different shenanigans. It was fun to learn about how to make modeling clay figurines dtand up properly by balancing them, and also techniques to make them as light as possible (hint: it involves a lot of styrofoam and tinfoil).", "thumb":"", "img":"http://i.imgur.com/ncTov1s.jpg", "tags":[]},
{"name":"Duck!", "desc":"I printed out the 3D modeled duck I created earlier and then tried to draw it using pencil.\n<br />\n<br />The primary focus of this was to be an exploration of form and shading.\n<br />\n<br />The 3D modeled duck had shadows that revealed its form, so I did my best to mimic those shadows to give my own duck form as well.\n<br />\n<br />I started off by drawing the basic shape of the duck, then I layered pencil shading, going from 2H to 6B. I also used a tissue to smooth out some of the graphite (since lighter pencils don't smooth out too well by themselves).", "thumb":"", "img":"http://i.imgur.com/m20OF3E.jpg", "tags":[]},
{"name":"Duck Model", "desc":"The 3D modeled duck that I created in the 3D builder app that comes pre-installed with Windows 10.\n<br />\n<br />This was a fun way to explore 3d modelling, since I had never tried it before from scratch.\n<br />\n<br />It was definitely one of the things I had more fun doing!", "thumb":"", "img":"http://i.imgur.com/5FLKUPw.jpg", "tags":[]},
{"name":"The Time-Travelling Pilot", "desc":"I created this piece by looking through a magazine and finding a picture of a person, and cutting that person's face in half. I proceeded to try to draw the other half of the person's face based solely on the half I had.\n<br />\n<br />The purpose of this was for me to learn more about how faces are structured and the symmetry and asymmetry of them.\n<br />\n<br />As it turns out, I am very un-flattering with my portraits, and the half of the face I drew ended up looking older than the other half. To make up for it, I just said the pilot goes so fast that some part of his body time travelled.\n<br />\n<br />This piece was also a fun exercise in shading. As always, I layered on graphite pencils ranging from HB to 6B (and 8B to emphasize some parts of his face), and then smoothed it out using my thumb or a tissue (though I admit that it may have been the side of my hand that rubbed the most graphite...).\n<br />\n<br />I also later created a face from scratch, but I found that it lacked the depth that this face did, so I decided not to post it.", "thumb":"", "img":"http://i.imgur.com/km4G0Lx.jpg", "tags":[]},
{"name":"Fish, Fish, Fish", "desc":"The assignment was to draw anything you wanted on a grid. It was the night before we had to come to class with a photo, and I was getting desperate. Finally, I noticed the clay fish that I had on my desk. I had gotten it when I was pretty young (I don't remember my exact age anymore) from Mexico and I had painted it myself (I was very proud of it at the time). I found it cool that I could paint something and then draw it years later, so I decided to pick that fish as my object.\n<br />\n<br />This was an exploration into grid drawing, as I used a computer program to put a grid overlay on a photo of the object that I took. Afterwards, I drew the same grid on a piece of paper. I started off by drawing the outline of the shape, and then I traced the main colour boundaries. Eventually, I coloured everything in using circular strokes with a softer pencil crayon (to prevent lines from showing through), and I had to blend some of my own colours on the page sometimes (since there were only around 12 colours).\n<br />\n<br />Overall, I found this assignment to be pretty fun and unique, and I'm mostly proud of the outcome.", "thumb":"", "img":"http://i.imgur.com/x31t8HL.jpg", "tags":[]},
{"name":"M", "desc":"This was a fun experiment with perspective. I have never drawn anything in 5-point perspective before, so I had to look it up online.\n<br />\n<br />Once I figured out how to draw something in 5-point perspective, I had to come up with an idea. I ended up picking something simple to start off with, but that also had some meaning to me: the first letter of my name, M.\n<br />\n<br />I also shaded in the result by making some of the area that would theoretically be less exposed to light darker, and lighter parts lighter.\n<br />\n<br />While there are some quirky parts in some of the lines, I personally think this is a good start to 5-point perspective.", "thumb":"", "img":"http://i.imgur.com/ncdOj1s.jpg", "tags":[]}
]
}